app/controllers/rentals_controller.rb

  def create
    @rental = Rental.create(params[:rental])
---
INSERT INTO `rentals` (`city`, `updated_at`, `number`, `zipcode`, `unit`, `country`, `street`, `created_at`) VALUES('Milan', '2011-12-19 04:33:28', '45', '56000', '100', 'Italy', 'Main st.', '2011-12-19 04:33:28')

  def search
    param_zipcode = params[:rental][:zipcode]
    @rentals = Rental.find_all_by_zipcode(param_zipcode)
---
SELECT * FROM `rentals` WHERE (`rentals`.`zipcode` = '56000') LIMIT 1

  def show_single
    param_id = params[:id]
    session[:rental_id] = param_id
    @rental = Rental.find_by_id(param_id)
---
SELECT * FROM `rentals` WHERE (`rentals`.`id` IS NULL) LIMIT 1