app/controllers/reviews_controller.rb

INSERT INTO `reviews` (`updated_at`, `rental_id`, `content`, `user_id`, `created_at`) VALUES('2011-12-19 05:59:41', 1, 'hot water runs out quickly', NULL, '2011-12-19 05:59:41')
---
  def create
    rental_id = session[:rental_id]
    params[:review][:rental_id] = rental_id
    @review = Review.create(params[:review])