app/controllers/users_controller.rb

  def loggedin
    @current_user_info = get_current_user_info
    user = User.find_by_fbid(@current_user_info.fbid)
    if user.nil?
      user = User.new
      user.name = @current_user_info.name
      user.fbid = @current_user_info.fbid
      user.save
---
SELECT * FROM `users` WHERE (`users`.`fbid` = '784863626') LIMIT 1
INSERT INTO `users` (`name`, `updated_at`, `fbid`, `created_at`) VALUES('Riccardo Turchetto', '2011-12-23 03:56:09', '784863626', '2011-12-23 03:56:09')